Repository: Myhr5/challenge_response
Catalog: lib/src/localization/app_*.arb
Languages: pt

# appTitle
source: Password Validator
pt: Validador de Senhas

# appSubtitle
source: Make sure you have a strong password!
pt: Verifique se você tem uma senha forte!

# formHintText
source: Password
pt: Senha

# formNullPasswordAlert
source: Enter a password
pt: Digite uma senha

# formAppButton
source: Validate
pt: Validar

# alertDialogContent
source: Are you sure you?
pt: Tem certeza que deseja sair?

# alertDialogCancelButton
source: Cancel
pt: Cancelar

# alertDialogGoOutButton
source: Leave
pt: Sair

source: Valid password!
pt: Senha válida!

source: Invalid password!
pt: Senha inválida!

# error
source: {error, select, other{''} errorMinimumChar{Minimum 8 characteres} errorMinimumDigit{Must have a digit} errorLowerChar{Must have a lower char} errorUpperChar{Must have an uppercase char} errorSpecialChar{Must have a special char}}
pt: {error, select, other{''} errorMinimumChar{Mínimo de 8 caracteres} errorMinimumDigit{Deve ter um número} errorLowerChar{Deve ter uma letra minúscula} errorUpperChar{Deve ter uma letra maiúscula} errorSpecialChar{Deve ter um caractere especial}}

# errorMinimumChar
source: Minimum 8 characteres
pt: Mínimo de 8 caracteres

# errorMinimumDigit
source: Must have a digit
pt: Deve ter um número

# errorLowerChar
source: Must have a lower char
pt: Deve ter uma letra minúscula

# errorUpperChar
source: Must have an uppercase char
pt: Deve ter uma letra maiúscula

# errorSpecialChar
source: Must have a special char
pt: Deve ter um caractere especial

# goodJob
source: Good job!!! ðŸŽ‰
pt: Bom trabalho!!! 🎉
